# Add_Remove_Rows_and_Columns_From_DataFrames

In [1]:
import pandas as pd

In [2]:
people = {
    "First_Name": ['Gautam','Soumya','Ashutosh'],
    "Last_Name" : ['Jha','Singh','Yadav'],
    "Email"     : ['Gautamjha@mail.com','SoumyaSingh@mail.com','AshutoshYadav@mail.com']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

  First_Name Last_Name                   Email
0     Gautam       Jha      Gautamjha@mail.com
1     Soumya     Singh    SoumyaSingh@mail.com
2   Ashutosh     Yadav  AshutoshYadav@mail.com

##### to add columns in dataframes

In [ ]:
df['Full_Name'] = df['First_Name'] + ' ' + df['Last_Name']

In [ ]:
df

##### using .drop  method to remove columns/rows

In [ ]:
df.drop(columns = ['First_Name','Full_Name'])

##### splitting the full name into two columns                  --> expand = true

In [ ]:
df['Full_Name'].str.split(' ',expand = True)

In [ ]:
df[['First_Name','Last_Name']]  = df['Full_Name'].str.split(' ',expand = True)

In [ ]:
df

###### adding a single row

In [5]:
df.append({'First_Name':'John','Last_Name':'Ching','Email':'JohnChing@email.com'},ignore_index = True)

  First_Name Last_Name                   Email
0     Gautam       Jha      Gautamjha@mail.com
1     Soumya     Singh    SoumyaSingh@mail.com
2   Ashutosh     Yadav  AshutoshYadav@mail.com
3       John     Ching     JohnChing@email.com

In [6]:
people = {
    "First_Name": ['Tony','Captain','Natasha'],
    "Last_Name" : ['Stark','Bihar','Romanov'],
    "Email"     : ['tonystark@mail.com','capbihar@mail.com','natty@mail.com']
}

In [7]:
df2 = pd.DataFrame(people)

In [8]:
df2

  First_Name Last_Name               Email
0       Tony     Stark  tonystark@mail.com
1    Captain     Bihar   capbihar@mail.com
2    Natasha   Romanov      natty@mail.com

##### adding to columns using .append

In [9]:
df.append(df2,ignore_index = True)

  First_Name Last_Name                   Email
0     Gautam       Jha      Gautamjha@mail.com
1     Soumya     Singh    SoumyaSingh@mail.com
2   Ashutosh     Yadav  AshutoshYadav@mail.com
3       Tony     Stark      tonystark@mail.com
4    Captain     Bihar       capbihar@mail.com
5    Natasha   Romanov          natty@mail.com

In [10]:
df = df.append(df2,ignore_index = True)

In [11]:
df

  First_Name Last_Name                   Email
0     Gautam       Jha      Gautamjha@mail.com
1     Soumya     Singh    SoumyaSingh@mail.com
2   Ashutosh     Yadav  AshutoshYadav@mail.com
3       Tony     Stark      tonystark@mail.com
4    Captain     Bihar       capbihar@mail.com
5    Natasha   Romanov          natty@mail.com

##### using .drop method to remove rows

In [14]:
df = df.drop(3)

In [15]:
df

  First_Name Last_Name                   Email
0     Gautam       Jha      Gautamjha@mail.com
1     Soumya     Singh    SoumyaSingh@mail.com
2   Ashutosh     Yadav  AshutoshYadav@mail.com
4    Captain     Bihar       capbihar@mail.com
5    Natasha   Romanov          natty@mail.com

In [20]:
df = df.drop(index = df[df['Last_Name'] == 'Yadav'].index)

In [21]:
df

  First_Name Last_Name                 Email
0     Gautam       Jha    Gautamjha@mail.com
1     Soumya     Singh  SoumyaSingh@mail.com
4    Captain     Bihar     capbihar@mail.com
5    Natasha   Romanov        natty@mail.com

In [30]:
y = df['Last_Name'] == 'Bihar'
df = df.drop(index = df[y].index)

In [31]:
df

  First_Name Last_Name                 Email
0     Gautam       Jha    Gautamjha@mail.com
1     Soumya     Singh  SoumyaSingh@mail.com
5    Natasha   Romanov        natty@mail.com